{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "file": "logo2.svg",
    "link": "http://homepages.dcc.ufmg.br/~mariana.santos/comusic",
    "text": "Mariana O. S. Silva"
  },
  "text": {
    "more": "Using data from Billboard and the Spotify platform, we construct a \"successful\" collaborative network. We collected all the artists on <a href=\"https://www.billboard.com/charts/artist-100\">Billboard's Artist 100</a> chart, a weekly ranking that lists the top 100 artists. In total, we collect <mark>211</mark> rankings between 2014 (July 26, 2014) and 2018 (July 28, 2018). As each chart consists of 100 artists, in total, we collect <mark>21,100</mark> musicians (and 1,135 distinct).<br><br> For more detailed information on each artist, we also collect data from <a href=\"https://www.spotify.com/\">Spotify</a>, one of the most popular and used music streaming platforms. Then, for each artist collected on the Billboard chart, we also collect features and its 10 most popular songs. In the same way, the musicians (and their features) that collaborate in the execution of the top 10 songs were also collected. Therefore, the total number of artists grew to <mark>2,152</mark>.<br><br> To model the music collaboration network, we collect all the artists who participated in the execution of a single &mdash; either as participation (featuring) or collaboration (with). The dataset was modeled as a bipartite graph, with edges between a set of songs and a set of selected agents (artists), indicating the individuals who collaborated in the execution of each song.<br><br> In the modeled graph, the sets of nodes can be divided into two groups: (S) set of singles; (A) set of successful artists who collaborated in the execution of the songs present in set S. The graph was then designed as a unimodal network such that every two nodes of set A are connected by a link, if they are connected to the same node of set S in the bipartite representation. In additions, songs that do not have more than one artist in their execution were modeled as self-loops on the artist's node.<br><br> Finally, we perform a network filtering. Only artists with a popularity rating greater or equal than <mark>70</mark>, as well as a number of followers approximately greater than <mark>1,000,000</mark>, were kept in the successful collaboration network. Below, we present some statistics of the original network and the filtered network.",
    "intro": "A collaboration musical network formed by artists from the Artist 100 Billboard chart.<br><br> Code adapted from work by <a href=\"http://www.oii.ox.ac.uk\" title=\"Oxford Internet Institute\"><span>OII</span></a> and <a href=\"http://jisc.ac.uk\" title=\"JISC\"><span>JISC</span></a>.",
    "title": "The Successful Network"
  },
  "legend": {
    "edgeLabel": "Musical Collaborations",
    "colorLabel": "Cluster",
    "nodeLabel": "Artists"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": "cluster id",
    "hoverBehavior": "dim"
  },
  "informationPanel": {
    "groupByEdgeDirection": false,
    "imageAttribute": "image"
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "curve",
      "defaultHoverLabelBGColor": "rgba(221, 221, 221, 0.5)",
      "defaultLabelBGColor": "rgba(221, 221, 221, 0.1)",
      "defaultLabelColor": "#a3a3a3",
      "labelThreshold": 10,
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "normal",
      "defaultLabelSize": 14
    },
    "graphProperties": {
      "maxEdgeSize": 0.5,
      "minEdgeSize": 0.2,
      "minNodeSize": 1,
      "maxNodeSize": 7
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}